{
    "0" : [
        "A clinical trial finds that 120 out of 150 people are protected by a vaccine, and the researcher wants to test if the vaccine's effectiveness is 80%.",
        "A company claims 90% of customers are satisfied; a survey of 200 customers shows 170 are satisfied.",
        "A researcher flips a coin 100 times and gets 60 heads; they want to test if the coin is fair.",
        "A politician claims that 70% of voters support their campaign; a poll of 500 voters shows 330 in favor.",
        "A school states that 95% of its graduates find employment within six months; a survey of 200 graduates finds 180 employed.",
        "A health official claims that 10% of the population is at risk of a certain disease; a sample of 1,000 people finds 80 at risk.",
        "A brand asserts that 85% of its customers are repeat buyers; a survey of 400 customers finds 320 are repeat buyers.",
        "A dairy company claims that only 5% of its milk cartons are defective; an inspection of 300 cartons finds 20 defects.",
        "A phone manufacturer claims that 99% of its phones pass quality tests; out of 1,000 phones tested, 985 pass.",
        "A survey suggests that 75% of people prefer online shopping; a sample of 600 people finds 450 prefer online shopping.",
        "A restaurant claims that 80% of its customers are satisfied with their service; a survey of 250 customers shows 200 are satisfied.",
        "A university states that 70% of applicants are accepted into their programs; out of 400 applicants, 280 are accepted.",
        "A survey claims that 65% of adults exercise regularly; a sample of 500 adults finds 320 who exercise regularly.",
        "A social media company asserts that 90% of users are satisfied with their privacy settings; a poll of 1,000 users finds 850 satisfied.",
        "A retailer claims that 30% of customers use their loyalty program; out of 800 customers surveyed, 240 use the program.",
        "A nonprofit organization claims that 25% of the population donates to charity; a sample of 1,200 people shows 300 donors.",
        "An airline claims that 95% of its flights are on time; a review of 600 flights shows 570 on time.",
        "A car manufacturer states that only 2% of their vehicles have defects; an inspection of 1,000 vehicles finds 30 defects.",
        "A mobile app developer claims that 85% of users find their app useful; a survey of 500 users finds 400 who find it useful.",
        "A coffee shop claims that 50% of its customers buy a pastry with their coffee; out of 200 customers, 110 buy a pastry."
    ],
    "1": [
        "A researcher compares the success rates of two treatments for a disease; Treatment A has 200 successes out of 300 patients, and Treatment B has 180 successes out of 350 patients.",
        "A company wants to compare the customer satisfaction rates of two different products; Product X has 150 satisfied customers out of 200, and Product Y has 130 satisfied customers out of 180.",
        "A school compares the graduation rates of two programs; Program A has 80 graduates out of 100 students, and Program B has 70 graduates out of 110 students.",
        "A survey compares the approval ratings of two politicians; Politician A has 220 supporters out of 400 respondents, and Politician B has 180 supporters out of 350 respondents.",
        "A marketing team compares the click-through rates of two online advertisements; Ad 1 receives 120 clicks out of 1,000 views, and Ad 2 receives 150 clicks out of 1,200 views.",
        "A health study compares the smoking rates between two age groups; Group 1 has 90 smokers out of 300 people, and Group 2 has 110 smokers out of 400 people.",
        "A researcher compares the pass rates of two standardized tests; Test A has 250 passers out of 500 students, and Test B has 230 passers out of 480 students.",
        "A company compares the defect rates of two production lines; Line 1 has 30 defects out of 1,000 products, and Line 2 has 50 defects out of 1,200 products.",
        "A political scientist compares the voter turnout rates in two districts; District A has 1,000 voters out of 2,000 eligible, and District B has 1,200 voters out of 2,500 eligible.",
        "A hospital compares the recovery rates of two surgical procedures; Procedure X has 150 recoveries out of 200 patients, and Procedure Y has 130 recoveries out of 190 patients.",
        "A researcher compares the allergy rates in two cities; City A has 80 people with allergies out of 500, and City B has 100 people with allergies out of 600.",
        "A marketing team compares the conversion rates of two sales strategies; Strategy 1 converts 300 out of 1,000 leads, and Strategy 2 converts 280 out of 950 leads.",
        "A school district compares the proficiency rates in math between two schools; School A has 200 proficient students out of 300, and School B has 180 proficient students out of 280.",
        "A company compares the retention rates of two employee training programs; Program 1 retains 90 out of 120 employees, and Program 2 retains 85 out of 110 employees.",
        "A research study compares the effectiveness of two diets; Diet A results in weight loss for 70 out of 100 participants, and Diet B results in weight loss for 65 out of 95 participants.",
        "A researcher compares the participation rates in two extracurricular activities; Activity 1 has 50 participants out of 200 students, and Activity 2 has 60 participants out of 210 students.",
        "A company compares the success rates of two sales teams; Team A closes 120 out of 300 deals, and Team B closes 110 out of 280 deals.",
        "A hospital compares the infection rates after two types of surgeries; Surgery A has 5 infections out of 200 patients, and Surgery B has 10 infections out of 250 patients.",
        "A health study compares the vaccination rates between two regions; Region 1 has 500 vaccinated out of 1,000 residents, and Region 2 has 450 vaccinated out of 950 residents.",
        "A university compares the acceptance rates of two departments; Department A accepts 200 out of 400 applicants, and Department B accepts 180 out of 370 applicants."
    ],
    "2": [
        "A researcher wants to test if the average weight of a sample of 30 apples is different from the known population mean of 150 grams.",
        "A teacher wants to test if the average score of a class of 25 students is higher than the school's average score of 75.",
        "A factory manager wants to determine if the average length of a sample of 20 rods is different from the standard length of 10 meters.",
        "A nutritionist wants to test if the average calorie intake of a sample of 50 people is lower than the recommended 2,000 calories per day.",
        "A biologist wants to know if the average height of a sample of 15 plants differs from the expected 30 centimeters.",
        "A car manufacturer wants to determine if the average fuel efficiency of a sample of 40 cars is higher than the industry standard of 25 miles per gallon.",
        "A company wants to test if the average lifespan of a sample of 35 batteries is different from the advertised 500 hours.",
        "A scientist wants to test if the average body temperature of a sample of 25 patients is higher than the normal 98.6°F.",
        "A university wants to determine if the average GPA of a sample of 100 students is different from the national average of 3.0.",
        "A health researcher wants to test if the average cholesterol level of a sample of 60 individuals is lower than the recommended level of 200 mg/dL.",
        "A quality control manager wants to determine if the average diameter of a sample of 25 bolts differs from the standard 5 millimeters.",
        "A sociologist wants to test if the average income of a sample of 50 households is different from the city's average of $60,000.",
        "A baker wants to determine if the average baking time of a sample of 30 cakes is different from the expected 45 minutes.",
        "A teacher wants to test if the average reading speed of a sample of 20 students is higher than the standard 200 words per minute.",
        "A researcher wants to determine if the average concentration of a sample of 10 solutions differs from the known concentration of 0.5 mol/L.",
        "A sports analyst wants to test if the average points scored by a sample of 15 basketball players is different from the league average of 20 points.",
        "A zoologist wants to determine if the average weight of a sample of 12 elephants is higher than the known average of 5,000 kilograms.",
        "A pharmacist wants to test if the average dissolution time of a sample of 20 pills is different from the standard 30 minutes.",
        "A financial analyst wants to determine if the average return of a sample of 25 investments is different from the expected 8%.",
        "A meteorologist wants to test if the average rainfall of a sample of 40 days is lower than the historical average of 3 inches."
    ],
    "3": [
        "A researcher compares the average test scores of two different teaching methods; Method A with a mean score of 85 from 30 students, and Method B with a mean score of 80 from 28 students.",
        "A company wants to determine if there is a difference in average productivity between two shifts; Shift 1 has an average of 50 units from 40 workers, and Shift 2 has an average of 55 units from 35 workers.",
        "A nutritionist compares the average weight loss of two diets; Diet A results in an average loss of 5 kg for 25 people, and Diet B results in an average loss of 6 kg for 30 people.",
        "A biologist wants to test if there is a difference in average growth between two species of plants; Species X grows an average of 10 cm for 20 plants, and Species Y grows an average of 12 cm for 18 plants.",
        "A car manufacturer compares the average fuel efficiency of two car models; Model A has an average efficiency of 25 mpg from 50 cars, and Model B has an average efficiency of 27 mpg from 45 cars.",
        "A school wants to determine if there is a difference in average math scores between two classes; Class 1 has an average score of 78 from 30 students, and Class 2 has an average score of 82 from 28 students.",
        "A health researcher compares the average cholesterol levels of two diets; Diet A has an average level of 190 mg/dL for 20 people, and Diet B has an average level of 185 mg/dL for 25 people.",
        "A sports analyst wants to test if there is a difference in average points scored by two basketball teams; Team A has an average of 90 points from 15 games, and Team B has an average of 88 points from 18 games.",
        "A sociologist compares the average income of two neighborhoods; Neighborhood A has an average income of $50,000 from 40 households, and Neighborhood B has an average income of $55,000 from 35 households.",
        "A psychologist wants to determine if there is a difference in average stress levels between two groups; Group A has an average stress score of 30 from 25 participants, and Group B has an average stress score of 28 from 30 participants.",
        "A marketing team compares the average sales of two advertising campaigns; Campaign 1 generates an average of $10,000 from 20 runs, and Campaign 2 generates an average of $12,000 from 18 runs.",
        "A teacher compares the average reading scores of two different reading programs; Program A has an average score of 85 from 25 students, and Program B has an average score of 88 from 28 students.",
        "A dietitian wants to test if there is a difference in average blood sugar levels between two diets; Diet A results in an average level of 95 mg/dL for 20 people, and Diet B results in an average level of 90 mg/dL for 22 people.",
        "A researcher compares the average time spent on social media by two age groups; Group 1 spends an average of 2 hours from 30 participants, and Group 2 spends an average of 1.5 hours from 25 participants.",
        "A university wants to determine if there is a difference in average starting salaries between graduates of two programs; Program A has an average salary of $50,000 from 20 graduates, and Program B has an average salary of $55,000 from 22 graduates.",
        "A health researcher compares the average blood pressure levels of two different exercise programs; Program A results in an average level of 120 mmHg for 15 participants, and Program B results in an average level of 115 mmHg for 18 participants.",
        "A company wants to test if there is a difference in average customer satisfaction between two products; Product A has an average satisfaction score of 4.5 from 50 customers, and Product B has an average satisfaction score of 4.2 from 55 customers.",
        "A researcher compares the average time to complete a task between two software tools; Tool A takes an average of 30 minutes from 20 users, and Tool B takes an average of 25 minutes from 22 users.",
        "A university wants to determine if there is a difference in average GPA between two majors; Major A has an average GPA of 3.2 from 30 students, and Major B has an average GPA of 3.5 from 28 students.",
        "A scientist wants to test if there is a difference in average growth rates between two fertilizers; Fertilizer A results in an average growth of 5 cm for 25 plants, and Fertilizer B results in an average growth of 6 cm for 30 plants."
    ],
    "4": [
        "A researcher tests if there is a difference in blood pressure before and after a treatment in the same group of 30 patients.",
        "A teacher wants to determine if students' test scores improve after a new teaching method by comparing scores from the same 25 students before and after the method is implemented.",
        "A company wants to test if a new training program improves employee productivity by comparing productivity levels of the same 20 employees before and after the training.",
        "A doctor wants to know if a new medication affects cholesterol levels by comparing the cholesterol levels of the same 15 patients before and after taking the medication.",
        "A coach wants to test if a new exercise routine improves athletic performance by comparing the performance metrics of the same 18 athletes before and after the routine.",
        "A scientist wants to determine if a chemical treatment affects plant growth by comparing the heights of the same 25 plants before and after the treatment.",
        "A nutritionist wants to test if a dietary supplement affects weight by comparing the weights of the same 30 individuals before and after taking the supplement.",
        "A psychologist wants to determine if a therapy method reduces anxiety by comparing the anxiety levels of the same 20 patients before and after the therapy.",
        "A researcher wants to test if a new study technique improves memory retention by comparing test scores of the same 15 students before and after using the technique.",
        "A company wants to determine if a new software update improves processing speed by comparing the speed of the same 25 computers before and after the update.",
        "A fitness trainer wants to test if a new workout plan increases strength by comparing the lifting weights of the same 20 clients before and after the plan.",
        "A scientist wants to test if a new fertilizer affects crop yield by comparing the yields of the same 10 plots before and after using the fertilizer.",
        "A researcher wants to determine if a new teaching strategy affects engagement by comparing the engagement scores of the same 30 students before and after the strategy.",
        "A company wants to test if a new customer service protocol improves satisfaction by comparing satisfaction scores of the same 40 customers before and after the protocol.",
        "A scientist wants to test if a new diet plan affects blood sugar levels by comparing levels of the same 18 individuals before and after the diet.",
        "A researcher wants to determine if a new therapy reduces depression symptoms by comparing the symptoms of the same 22 patients before and after the therapy.",
        "A fitness coach wants to test if a new running program improves speed by comparing the race times of the same 15 runners before and after the program.",
        "A school wants to determine if a new curriculum improves reading skills by comparing test scores of the same 28 students before and after the curriculum.",
        "A company wants to test if a new marketing strategy increases sales by comparing the sales figures of the same 35 products before and after the strategy.",
        "A researcher wants to test if a new learning app improves language skills by comparing language test scores of the same 20 students before and after using the app."
    ],
    "5": [
        "A geneticist wants to test if the observed frequencies of different flower colors match the expected ratios in a Mendelian inheritance experiment.",
        "A dice manufacturer wants to test if a die is fair by comparing the observed frequencies of each face to the expected equal frequencies.",
        "A researcher wants to determine if the observed distribution of blood types in a sample matches the expected distribution in the general population.",
        "A company wants to test if customer preferences for product colors match the expected market research proportions.",
        "A teacher wants to test if the observed grades in a class match the expected distribution based on historical data.",
        "A biologist wants to test if the observed frequencies of different insect species match the expected proportions in an ecosystem.",
        "A marketing team wants to test if the observed preferences for different advertisements match the expected preferences based on a survey.",
        "A researcher wants to determine if the observed frequencies of different genetic traits match the expected ratios in a population.",
        "A game developer wants to test if the observed frequencies of outcomes in a game match the expected probabilities.",
        "A sociologist wants to test if the observed distribution of household sizes matches the expected distribution in a city.",
        "A quality control manager wants to test if the observed defect types in a production process match the expected proportions.",
        "A psychologist wants to determine if the observed frequencies of different personality types match the expected distribution in a sample.",
        "A company wants to test if the observed sales of products in different regions match the expected sales based on market analysis.",
        "A researcher wants to test if the observed distribution of responses to a survey question matches the expected distribution.",
        "A zoologist wants to test if the observed frequencies of different animal behaviors match the expected proportions in a study.",
        "A retail store wants to determine if the observed purchase frequencies of different product categories match the expected frequencies.",
        "A researcher wants to test if the observed distribution of academic majors matches the expected distribution based on enrollment data.",
        "A pollster wants to test if the observed voting preferences match the expected proportions based on pre-election polls.",
        "A scientist wants to determine if the observed frequencies of different chemical reactions match the expected ratios.",
        "A researcher wants to test if the observed distribution of car colors in a parking lot matches the expected distribution."
    ],
    "6": [
        "A researcher wants to test if there is an association between gender and voting preference in a sample of 500 people.",
        "A sociologist wants to determine if there is a relationship between education level and income category in a survey of 1,000 individuals.",
        "A company wants to test if there is a link between customer age group and product preference in a market analysis.",
        "A health researcher wants to determine if there is an association between smoking status and incidence of lung disease in a study of 2,000 participants.",
        "A teacher wants to test if there is a relationship between study habits and academic performance in a class of 100 students.",
        "A political scientist wants to determine if there is an association between political affiliation and support for a policy in a survey of 800 voters.",
        "A marketing team wants to test if there is a link between advertisement type and purchase decision in an experiment with 300 consumers.",
        "A psychologist wants to determine if there is a relationship between personality type and career choice in a sample of 500 adults.",
        "A company wants to test if there is an association between training program and employee retention in a study of 1,200 employees.",
        "A sociologist wants to determine if there is a link between marital status and happiness level in a survey of 700 people.",
        "A researcher wants to test if there is a relationship between diet type and weight loss success in a study of 400 participants.",
        "A health organization wants to determine if there is an association between exercise frequency and heart disease incidence in a study of 1,500 individuals.",
        "A school wants to test if there is a link between extracurricular activity participation and academic success in a sample of 600 students.",
        "A company wants to determine if there is a relationship between job role and job satisfaction in a survey of 1,000 employees.",
        "A sociologist wants to test if there is an association between neighborhood type and crime rate in a study of 300 neighborhoods.",
        "A researcher wants to determine if there is a relationship between internet usage and social interaction levels in a survey of 800 individuals.",
        "A health researcher wants to test if there is a link between alcohol consumption and liver disease in a study of 1,200 participants.",
        "A political analyst wants to determine if there is an association between region and voting turnout in an analysis of 50 regions.",
        "A company wants to test if there is a relationship between product type and return rate in a study of 500 product returns.",
        "A researcher wants to determine if there is an association between sleep patterns and productivity levels in a study of 300 participants."
    ],
    "7": [
        "A researcher wants to test if the distribution of blood types is the same across different ethnic groups in a sample of 1,000 people.",
        "A company wants to determine if customer satisfaction levels are consistent across different store locations in a survey of 800 customers.",
        "A school wants to test if the distribution of grades is similar across different classes in a sample of 200 students.",
        "A health researcher wants to determine if the incidence of a disease is the same across different age groups in a study of 1,500 participants.",
        "A marketing team wants to test if the preferences for a new product are consistent across different regions in a market analysis.",
        "A political scientist wants to determine if voting patterns are similar across different districts in an election study.",
        "A sociologist wants to test if the distribution of household sizes is the same across different neighborhoods in a survey of 600 households.",
        "A researcher wants to determine if the frequency of internet usage is consistent across different age groups in a sample of 500 people.",
        "A health organization wants to test if the rates of vaccination are the same across different communities in a study of 1,200 participants.",
        "A company wants to determine if employee retention rates are consistent across different departments in a survey of 1,000 employees.",
        "A researcher wants to test if the distribution of leisure activities is the same across different age groups in a study of 300 participants.",
        "A school wants to determine if participation in extracurricular activities is consistent across different grade levels in a sample of 400 students.",
        "A marketing team wants to test if brand loyalty is the same across different customer segments in a survey of 700 consumers.",
        "A researcher wants to determine if the frequency of exercise is consistent across different income groups in a study of 500 participants.",
        "A health researcher wants to test if the incidence of diabetes is the same across different ethnic groups in a study of 1,000 individuals.",
        "A political analyst wants to determine if the distribution of political affiliations is consistent across different regions in a survey of 800 voters.",
        "A company wants to test if the return rates are the same across different product categories in an analysis of 1,200 returns.",
        "A researcher wants to determine if the distribution of reading habits is consistent across different education levels in a survey of 600 people.",
        "A health organization wants to test if the frequency of health check-ups is the same across different age groups in a study of 1,500 participants.",
        "A school wants to determine if the distribution of test scores is similar across different subjects in a sample of 200 students."
    ],
    "8": [
        "A researcher wants to test if there is a significant relationship between hours studied and test scores in a sample of 50 students.",
        "A health researcher wants to determine if there is a significant association between daily exercise time and cholesterol levels in a study of 200 individuals.",
        "A company wants to test if there is a significant relationship between advertising expenditure and sales revenue in a sample of 30 months of data.",
        "A biologist wants to determine if there is a significant association between sunlight exposure and plant growth in a study of 40 plants.",
        "A sociologist wants to test if there is a significant relationship between education level and income in a survey of 1,000 people.",
        "A researcher wants to determine if there is a significant association between age and blood pressure in a study of 150 participants.",
        "A company wants to test if there is a significant relationship between product price and sales volume in an analysis of 25 products.",
        "A health researcher wants to determine if there is a significant association between sleep duration and cognitive performance in a study of 100 individuals.",
        "A teacher wants to test if there is a significant relationship between attendance and academic performance in a class of 30 students.",
        "A marketing team wants to determine if there is a significant association between social media engagement and brand awareness in a study of 50 campaigns.",
        "A scientist wants to test if there is a significant relationship between fertilizer amount and crop yield in an experiment with 60 plots.",
        "A financial analyst wants to determine if there is a significant association between investment amount and return in a study of 80 portfolios.",
        "A researcher wants to test if there is a significant relationship between screen time and eye strain in a study of 90 participants.",
        "A health organization wants to determine if there is a significant association between diet quality and BMI in a study of 300 individuals.",
        "A company wants to test if there is a significant relationship between training hours and employee productivity in a survey of 120 employees.",
        "A sociologist wants to determine if there is a significant association between urbanization and pollution levels in a study of 50 cities.",
        "A researcher wants to test if there is a significant relationship between stress levels and job performance in a study of 70 employees.",
        "A school wants to determine if there is a significant association between homework time and test scores in a sample of 60 students.",
        "A company wants to test if there is a significant relationship between customer service training and customer satisfaction in a survey of 40 employees.",
        "A health researcher wants to determine if there is a significant association between alcohol consumption and liver enzyme levels in a study of 250 participants."
    ],
    "9": [
        "A pollster wants to estimate the proportion of voters who support a particular candidate in an election based on a sample of 1,000 voters.",
        "A researcher wants to estimate the proportion of people who favor a new policy based on a survey of 800 respondents.",
        "A company wants to estimate the proportion of customers who are satisfied with their product based on a survey of 500 customers.",
        "A school wants to estimate the proportion of students who pass a particular exam based on a sample of 200 students.",
        "A health organization wants to estimate the proportion of people who smoke in a population based on a survey of 1,500 individuals.",
        "A marketing team wants to estimate the proportion of consumers who recognize their brand based on a sample of 600 consumers.",
        "A researcher wants to estimate the proportion of people who exercise regularly based on a survey of 700 participants.",
        "A political analyst wants to estimate the proportion of people who approve of a government policy based on a survey of 1,200 individuals.",
        "A company wants to estimate the proportion of employees who are satisfied with their job based on a survey of 300 employees.",
        "A researcher wants to estimate the proportion of households that recycle based on a survey of 400 households.",
        "A health researcher wants to estimate the proportion of people with a specific health condition based on a sample of 1,000 participants.",
        "A university wants to estimate the proportion of students who graduate on time based on a sample of 500 students.",
        "A pollster wants to estimate the proportion of voters who are undecided in an election based on a survey of 800 voters.",
        "A company wants to estimate the proportion of customers who would recommend their product based on a survey of 600 customers.",
        "A researcher wants to estimate the proportion of people who volunteer regularly based on a survey of 700 respondents.",
        "A health organization wants to estimate the proportion of people who have received a vaccination based on a survey of 1,200 individuals.",
        "A school wants to estimate the proportion of students who participate in extracurricular activities based on a sample of 400 students.",
        "A company wants to estimate the proportion of employees who have received a promotion in the last year based on a survey of 300 employees.",
        "A researcher wants to estimate the proportion of people who use public transportation based on a survey of 500 participants.",
        "A political analyst wants to estimate the proportion of people who have donated to a political campaign based on a survey of 1,000 individuals."
    ],
    "10": [
        "A researcher wants to estimate the difference in the proportion of males and females who favor a new policy based on a survey of 500 males and 500 females.",
        "A company wants to estimate the difference in the proportion of customers satisfied with two different products based on surveys of 300 customers for each product.",
        "A health researcher wants to estimate the difference in the proportion of smokers and non-smokers who develop lung disease based on a study of 1,000 smokers and 1,000 non-smokers.",
        "A political analyst wants to estimate the difference in the proportion of urban and rural residents who support a candidate based on surveys of 800 urban and 800 rural residents.",
        "A school wants to estimate the difference in the proportion of students passing two different exams based on samples of 200 students for each exam.",
        "A marketing team wants to estimate the difference in the proportion of consumers who recognize two different brands based on surveys of 500 consumers for each brand.",
        "A researcher wants to estimate the difference in the proportion of people who exercise regularly in two different age groups based on surveys of 400 people in each group.",
        "A company wants to estimate the difference in the proportion of employees satisfied with their jobs in two different departments based on surveys of 300 employees in each department.",
        "A health organization wants to estimate the difference in the proportion of vaccinated and unvaccinated people who develop a disease based on a study of 1,000 vaccinated and 1,000 unvaccinated individuals.",
        "A school wants to estimate the difference in the proportion of students who participate in sports in two different grades based on samples of 200 students in each grade.",
        "A researcher wants to estimate the difference in the proportion of people who use public transportation in two different cities based on surveys of 500 people in each city.",
        "A political analyst wants to estimate the difference in the proportion of supporters of two different political parties based on surveys of 1,000 supporters for each party.",
        "A company wants to estimate the difference in the proportion of customers who would recommend two different services based on surveys of 300 customers for each service.",
        "A health researcher wants to estimate the difference in the proportion of people with a health condition in two different regions based on studies of 1,000 people in each region.",
        "A marketing team wants to estimate the difference in the proportion of consumers who prefer two different advertising campaigns based on surveys of 500 consumers for each campaign.",
        "A researcher wants to estimate the difference in the proportion of volunteers in two different communities based on surveys of 400 people in each community.",
        "A company wants to estimate the difference in the proportion of employees who have received a promotion in two different branches based on surveys of 300 employees in each branch.",
        "A health organization wants to estimate the difference in the proportion of people with high blood pressure in two different age groups based on studies of 1,000 people in each group.",
        "A school wants to estimate the difference in the proportion of students who pass two different subjects based on samples of 200 students for each subject.",
        "A researcher wants to estimate the difference in the proportion of people who donate to charity in two different income groups based on surveys of 500 people in each group."
    ],
    "11": [
        "A researcher wants to estimate the average height of a population based on a sample of 50 people.",
        "A company wants to estimate the average satisfaction score of their customers based on a survey of 300 customers.",
        "A health researcher wants to estimate the average cholesterol level in a population based on a study of 200 individuals.",
        "A teacher wants to estimate the average test score of a class based on a sample of 30 students.",
        "A nutritionist wants to estimate the average daily calorie intake of a population based on a survey of 150 people.",
        "A biologist wants to estimate the average growth rate of a plant species based on a study of 40 plants.",
        "A company wants to estimate the average productivity of their employees based on a survey of 100 employees.",
        "A sociologist wants to estimate the average household income in a city based on a survey of 400 households.",
        "A health organization wants to estimate the average BMI in a population based on a study of 500 participants.",
        "A university wants to estimate the average GPA of their students based on a sample of 200 students.",
        "A pollster wants to estimate the average approval rating of a politician based on a survey of 1,000 voters.",
        "A researcher wants to estimate the average number of hours worked per week by a population based on a survey of 300 people.",
        "A marketing team wants to estimate the average brand recognition score based on a survey of 600 consumers.",
        "A health researcher wants to estimate the average blood pressure in a population based on a study of 250 individuals.",
        "A company wants to estimate the average time to complete a task based on a study of 50 employees.",
        "A researcher wants to estimate the average concentration of a solution based on a sample of 30 measurements.",
        "A teacher wants to estimate the average reading speed of students based on a sample of 25 students.",
        "A scientist wants to estimate the average temperature of a region based on a study of 1,000 daily temperatures.",
        "A sociologist wants to estimate the average family size in a community based on a survey of 300 families.",
        "A health organization wants to estimate the average number of doctor visits per year based on a study of 500 individuals."
    ],
    "12": [
        "A researcher wants to estimate the difference in average test scores between two classes based on samples of 30 students from each class.",
        "A health researcher wants to estimate the difference in average cholesterol levels between men and women based on a study of 200 men and 200 women.",
        "A company wants to estimate the difference in average productivity between two departments based on surveys of 50 employees from each department.",
        "A biologist wants to estimate the difference in average growth rates between two plant species based on a study of 40 plants from each species.",
        "A teacher wants to estimate the difference in average reading speeds between two grades based on samples of 25 students from each grade.",
        "A health organization wants to estimate the difference in average BMI between two age groups based on studies of 300 individuals from each group.",
        "A researcher wants to estimate the difference in average income between two cities based on surveys of 400 households from each city.",
        "A company wants to estimate the difference in average satisfaction scores between two products based on surveys of 300 customers for each product.",
        "A university wants to estimate the difference in average GPAs between two programs based on samples of 50 students from each program.",
        "A health researcher wants to estimate the difference in average blood pressure between two ethnic groups based on a study of 250 individuals from each group.",
        "A teacher wants to estimate the difference in average math scores between two teaching methods based on samples of 30 students for each method.",
        "A company wants to estimate the difference in average training times between two training programs based on a study of 50 employees for each program.",
        "A scientist wants to estimate the difference in average temperatures between two regions based on a study of 1,000 daily temperatures from each region.",
        "A health organization wants to estimate the difference in average exercise times between two communities based on studies of 200 people from each community.",
        "A researcher wants to estimate the difference in average sleep durations between two age groups based on surveys of 300 individuals from each group.",
        "A teacher wants to estimate the difference in average writing scores between two classrooms based on samples of 25 students from each classroom.",
        "A company wants to estimate the difference in average time to market between two product development processes based on a study of 30 products from each process.",
        "A researcher wants to estimate the difference in average stress levels between two occupations based on surveys of 50 individuals from each occupation.",
        "A health organization wants to estimate the difference in average vaccination rates between two regions based on studies of 500 individuals from each region.",
        "A sociologist wants to estimate the difference in average family sizes between two neighborhoods based on surveys of 300 families from each neighborhood."
    ],
    "13": [
        "A researcher wants to estimate the difference in average test scores before and after implementing a new teaching method on the same 30 students.",
        "A health researcher wants to estimate the difference in average cholesterol levels before and after a dietary intervention in the same 50 individuals.",
        "A company wants to estimate the difference in average productivity before and after using new software on the same 40 employees.",
        "A teacher wants to estimate the difference in average exam scores before and after a study strategy is used by the same 20 students.",
        "A researcher wants to estimate the difference in average blood pressure before and after a medication is administered to the same 60 patients.",
        "A university wants to estimate the difference in average GPA before and after a tutoring program on the same 50 students.",
        "A company wants to estimate the difference in average customer satisfaction before and after a service change based on surveys from the same 100 customers.",
        "A scientist wants to estimate the difference in average plant growth before and after a fertilizer is applied to the same 30 plants.",
        "A health organization wants to estimate the difference in average weight before and after a fitness program in the same 200 individuals.",
        "A researcher wants to estimate the difference in average reading speed before and after a training program in the same 25 students.",
        "A marketing team wants to estimate the difference in average brand recognition before and after an advertising campaign on the same 100 consumers.",
        "A health researcher wants to estimate the difference in average blood sugar levels before and after a treatment in the same 70 patients.",
        "A teacher wants to estimate the difference in average homework completion rates before and after a policy change on the same 30 students.",
        "A company wants to estimate the difference in average sales performance before and after a new incentive program in the same 50 sales representatives.",
        "A researcher wants to estimate the difference in average cognitive performance before and after a mental training program in the same 80 individuals.",
        "A health organization wants to estimate the difference in average physical activity levels before and after a community intervention in the same 150 participants.",
        "A scientist wants to estimate the difference in average air quality measurements before and after a policy implementation in the same 20 locations.",
        "A researcher wants to estimate the difference in average stress levels before and after a mindfulness program in the same 90 employees.",
        "A company wants to estimate the difference in average project completion time before and after a process change in the same 40 teams.",
        "A teacher wants to estimate the difference in average attendance rates before and after a new attendance policy on the same 60 students."
    ],
    "14": [
        "A researcher wants to estimate the slope of the relationship between hours studied and exam scores in a sample of 100 students.",
        "A health researcher wants to estimate the slope of the relationship between daily calorie intake and weight loss in a sample of 200 individuals.",
        "A company wants to estimate the slope of the relationship between training hours and employee productivity based on a sample of 50 employees.",
        "A scientist wants to estimate the slope of the relationship between fertilizer amount and plant growth in an experiment with 60 plants.",
        "A marketing team wants to estimate the slope of the relationship between advertising expenditure and sales revenue based on data from 30 campaigns.",
        "A researcher wants to estimate the slope of the relationship between sleep duration and cognitive performance in a study of 80 participants.",
        "A health organization wants to estimate the slope of the relationship between physical activity and blood pressure in a sample of 300 individuals.",
        "A teacher wants to estimate the slope of the relationship between class attendance and grades in a sample of 100 students.",
        "A company wants to estimate the slope of the relationship between customer satisfaction and repeat purchase rate based on a survey of 200 customers.",
        "A scientist wants to estimate the slope of the relationship between temperature and reaction rate in a chemical experiment with 40 trials.",
        "A researcher wants to estimate the slope of the relationship between study time and GPA in a sample of 150 students.",
        "A health researcher wants to estimate the slope of the relationship between medication dosage and symptom reduction in a study of 90 patients.",
        "A marketing team wants to estimate the slope of the relationship between social media engagement and brand awareness in a study of 50 campaigns.",
        "A company wants to estimate the slope of the relationship between work experience and salary in a survey of 300 employees.",
        "A researcher wants to estimate the slope of the relationship between exercise frequency and fitness level in a study of 100 participants.",
        "A health organization wants to estimate the slope of the relationship between diet quality and cholesterol levels in a sample of 150 individuals.",
        "A scientist wants to estimate the slope of the relationship between light exposure and plant growth in an experiment with 60 plants.",
        "A teacher wants to estimate the slope of the relationship between homework completion and test scores in a sample of 80 students.",
        "A company wants to estimate the slope of the relationship between service quality and customer loyalty based on a survey of 120 customers.",
        "A researcher wants to estimate the slope of the relationship between screen time and eye strain in a study of 100 individuals."
    ]
}