{
    "Summary" : {
        "text" : "<h1>Proofs</h1>",
        "image" : "<div class=\"image\"><img src=\"/imgs/Proofs/0.png\" alt=\"\"><p>Proofs graphic.</p></div>"
    },
    "pythagorean-theorem-and-distance-formula-derivation" : {
        "title" : "The Pythagorean Theorem and The Distance Formula Derivation",
        "sections" : [
            {
                "text" : "<h1>The Pythagorean Theorem and The Distance Formula Derivation</h1><i>Alexander De Carlo</i><br><p>The Pythagorean Theorem is one of the most fundamental theorems in all of Mathematics, but little are familiar with the proof of such a formula. This theorem is used to find the length of any diagonal line which gives us a formula for how to calculate the distance between two points in space. But how was it proven?</p><p>Let's throw away any knowledge of the Pythagorean Theorem and simply try to answer this question: What is the length of this line on the coordinate plane?</p><img src='/imgs/Proofs/1_1.png' alt='A line drawn from point A (-6, -3) to point B (7, 6).'><p>Looking at the image, we can see that <strong>A = (-6, -3)</strong>, and <strong>B = (7, 6)</strong>. We can easily calculate distance when the points are on the same dimension, but how do we calculate distance when two dimensions are involved? Looking at <strong>A</strong> and <strong>B</strong>, we can see they are 13 units away horizontally and 12 units away vertically. Let's represent this as a triangle.</p>",
                "image" : "<div class=\"image\"><img src=\"/imgs/Trigonometry/1_2.png\" alt=\"\"><p>Diagram of right triangle.</p></div>"
            },
            {
                "text" : "<p>Here, <strong>c</strong> is our unknown, <strong>b</strong> is 13 and <strong>a</strong> is 12. This creates a right triangle. Right triangles are special for many reasons - a big factor being their properties of similarity.</p><img src='/imgs/Proofs/1_2.png' alt='A diagram of a right triangle labeled \"3 - Entire Triangle,\" subdivided into two smaller right triangles and a quadrilateral, with vertices A, B, C, and key points D, E, F, and G. The accompanying text explains angle congruence and AA symmetry, concluding that triangles 1, 2, and 3 are similar.'><p>Above shows how each component angle of each triangle must be all equivalent when <strong>Triangle 3</strong> is bisected to where it internally creates <strong>Triangle 1</strong> and <strong>Triangle 2</strong>. What similarity tells us is that the ratios of the side lengths must be equivalent. This is because while the triangles can have different sizes overall, their interior angles dictate the side length proportions. Therefore, when two angles are shown to be equal, the third must also be equal, creating these proportions. For example, in the previous model: <strong>a / b = e / d</strong>. Right triangles are the only triangles where you can have this and its two components similar, due to the creation of two equal degree angles when bisecting the hypotenuse. You can mess around with these ratios and find many relationships, so let's try to expand and discover something we didn't expect.</p>",
                "image" : "<div class=\"image\"><img src=\"/imgs/Proofs/1_3.png\" alt=\"\"><p>A triangle representation of the distance between points <strong>A</strong> and <strong>B</strong>.</p></div>"
            },
            {
                "text" : "<p>Consider two ratios: <strong>a / c = e / a</strong> and <strong>b / c = f / b</strong>. These ratios are particularly interesting because they contain <strong>a</strong> and <strong>b</strong> side lengths of the main triangle twice in their respective equations. By cross multiplying, <strong>a<sup>2</sup> = ce</strong> and <strong>b<sup>2</sup> = cf</strong>. Since <strong>c</strong> is in both of these equations, let's add them together to simplify things: <strong>a<sup>2</sup> + b<sup>2</sup> = ce + cf</strong>. It is clear that we can factor out <strong>c</strong>: <strong>a<sup>2</sup> + b<sup>2</sup> = c(e + f)</strong>. Looking at the diagram: <strong>e + f = c</strong>, meaning we can substitute <strong>e + f</strong> out for <strong>c</strong> and get <strong>a<sup>2</sup> + b<sup>2</sup> = c<sup>2</sup></strong>. This relationship is not obvious at all, but can beautifully be derived from very simple similarity relationships. Some good news here is that since <strong>c</strong> is isolated, we can solve for the diagonal side length of a triangle given only vertical and horizontal lengths, being <strong>c = sqrt(a<sup>2</sup> + b<sup>2</sup>)</strong>. We can finally get that equation for the distance of any two points on a plane.</p><br><br><p><strong>let D be the distance<br>C = sqrt(a<sup>2</sup> + b<sup>2</sup>)</strong> (Substitute out hypotenuse length <strong>c</strong>.)<br><strong>D = sqrt(a<sup>2</sup> + b<sup>2</sup>)</strong> (<strong>a</strong> is our vertical length and <strong>b</strong> is our horizontal length.)<br><strong>a = | y<sub>1</sub> - y<sub>2</sub> |<br>b = | x<sub>1</sub> - x<sub>2</sub> |<br>D = sqrt((y<sub>2</sub> - y<sub>1</sub>)<sup>2</sup> + (x<sub>2</sub> - x<sub>1</sub>)<sup>2</sup>)</strong> (The absolute values are removed because the whole thing is squared, and since <strong>negative * negative = positive</strong>, the order of variables doesn't matter.)</p><br><br><p>Now we can find the distance between <strong>A = (-6, -3)</strong> and <strong>B = (7, 6)</strong>. With proper substitution we get:</p><br><br><strong>D = sqrt((-3 - 6)<sup>2</sup> + (-6 - 7)<sup>2</sup>)<br>D = sqrt(81 + 169)<br>D = sqrt(250) = ≈15.811</strong>",
                "image" : ""
            }
        ]
    },
    "three-dimensional-pythagorean-theorem" : {
        "title" : "Three Dimensional Pythagorean Theorem",
        "sections" : [
            {
                "text" : "<h1>Three Dimensional Pythagorean Theorem</h1><i>Alexander De Carlo</i><p>Deriving the Pythagorean Theorem in three dimensions is surprisingly simple, as it builds on the 2D Pythagorean Theorem. The Pythagorean Theorem in two dimensions states: <strong>a<sup>2</sup> + b<sup>2</sup> = c<sup>2</sup></strong>, where <strong>a</strong> and <strong>b</strong> are the legs of a right triangle, and <strong>c</strong> is the hypotenuse.</p><img src='/imgs/Proofs/1_4.png' alt='A 3D diagram of a rectangular prism with vertices labeled x, y, z, and segments c, s inside the prism. The points x and z are connected by lines, indicating a diagonal across one face and another across the volume.'><p>From this three dimensional illustration, we want to find what <strong>s</strong> is from non-angled lines: <strong>x</strong>, <strong>y</strong> and <strong>z</strong>.With help from the Pythagorean Theorem, we can deduce: <strong>c<sup>2</sup> = x<sup>2</sup> + y<sup>2</sup></strong>. We can also notice that on the rectangular prism, <strong>z</strong> stays completely vertical. With that information, it is time to use the Pythagorean Theorem on the triangle containing <strong>s</strong>.</p><br><br><p><strong>z<sup>2</sup> + (sqrt(x<sup>2</sup> + y<sup>2</sup>))<sup>2</sup> = s<sup>2</sup><br>x<sup>2</sup> + y<sup>2</sup> + z<sup>2</sup> = s<sup>2</sup></strong> (Absolute value signs are not needed when canceling out due to <strong>x</strong> and <strong>y</strong> both squared.)</p><br><br><p>With changing the variable names to match the Pythagorean Theorem, we get: <strong>a<sup>2</sup> + b<sup>2</sup> + c<sup>2</sup> = d<sup>2</sup></strong>. There is a clear pattern when increasing one dimension, and it's by simply adding a new variable. To find a distance formula in 3D space, the process is exactly the same:</p><br><br><strong>D = sqrt((x<sub>2</sub> - x<sub>1</sub>)<sup>2</sup> + (y<sub>2</sub> - y<sub>1</sub>)<sup>2</sup> + (z<sub>2</sub> - z<sub>1</sub>)<sup>2</sup>)</strong><br><br><p>When going up a dimension, all you need to do is add the subtracted coordinates squared. You can see this in action when going down dimensions. If <strong>D = sqrt((x<sub>2</sub> - x<sub>1</sub>)<sup>2</sup> + (y<sub>2</sub> - y<sub>1</sub>)<sup>2</sup> + (z<sub>2</sub> - z<sub>1</sub>)<sup>2</sup>)</strong>, decreasing to a single dimension gives us <strong>D = sqrt(x<sub>2</sub> - x<sub>1</sub>)<sup>2</sup>)</strong>, which when canceled is: <strong>D = | x<sub>2</sub> - x<sub>1</sub> |</strong>, the formula for finding the distance between two points on the number line.</p><p>Therefore, for <strong>n</strong> dimensions, the Pythagorean Theorem theoretically would be: <strong>a<sub>1</sub><sup>2</sup> + … + a<sub>n</sub><sup>2</sup> = c<sup>2</sup></strong>, where <strong>n</strong> is the amount of dimensions, each term is the distance in its dimension, and <strong>c</strong> is the hypotenuse.</p>",
                "image" : "<div class=\"image\"><img src=\"/imgs/Trigonometry/1_2.png\" alt=\"Diagram of right triangle.\"><p>Diagram of right triangle.</p></div>"
            }
        ]
    },
    "proof-of-the-fundamental-theorem-of-calculus-part-i": {
        "title": "Proof of the Fundamental Theorem of Calculus Part I",
        "sections": [
            {
                "text": "<h1>Proof of the Fundamental Theorem of Calculus Part I</h1><i>Alexander De Carlo</i><p>Proving the fundamental theorem of calculus consists of two parts. Interestingly, the 'first part' was proved secondly, and the 'second part' was proved first. However, it makes much more sense for any calculus student to learn the first part's proof, then the second one, despite the order that they were proven. So let's jump right into the first part!</p><p>The first part of the fundamental theorem of calculus connects the idea of a <strong>derivative</strong> and an <strong>integral</strong>. It states that the <strong>derivative</strong> of an <strong>integral</strong> returns the original function. In mathematical notation: \\[\\frac{d}{dx}\\left[\\int f(x) \\, dx\\right] = f(x)\\]This can also be used to say that the <strong>integral</strong> of <strong>f(x)</strong> (area under the curve) is just the <strong>antiderivative</strong> of <strong>f(x)</strong>, or in simpler terms, a function <strong>g(x)</strong> where it's derivative of <strong>f(x)</strong>. As we can see, proving this theorem will give us a gateway into actually solving <strong>integrals</strong>, one of the hardest tasks in calculus.</p><p>But why would we even consider a relationship in the first place? Well, let's consider a very general function, <strong>f(x)</strong>.</p><img src='/imgs/Proofs/3_1.png' alt='Graph showing the area under the curve f(x) from red vertical line a to blue vertical line x, creating bounds representing the area function, A(x).'><p>Observe <strong>f(x)</strong> and <strong>A(x)</strong>, where <strong>A(x)</strong> is the area function. Basically, we are assuming that the area under any curve can be considered some function of <strong>x</strong>. As we see with the blue line to the right, changing that also changes the overall area of the function. If <strong>f(x)</strong> is decreasing, then the added area to <strong>A(x)</strong> will become less and less large. Here, we can intuitively see a connection to the <strong>derivative</strong> of <strong>f(x)</strong> and <strong>A(x)</strong>. It just so happens that the area function IS the <strong>antiderivative</strong> of <strong>f(x)</strong>, which is less intuitive to see.</p><p>Lets begin with the proof:</p><p>Consider <strong>A(x)</strong> and <strong>f(x)</strong> where <strong>A(x)</strong> is the area function to <strong>f(x)</strong>. We are to prove that <strong>A'(x) = f(x)</strong>.</p><p>Let's begin with the definition of a <strong>derivative</strong>, just to see if we can work with that somehow: \\[ A'(x) = \\lim_{h \\to 0} \\left[ \\frac{A(x+h) - A(x)}{h} \\right] \\]</p><p>Notice <strong>A(x + h)</strong> and <strong>A(x)</strong>. These appear to be the difference of two areas. Let's represent this graphically.</p><img src='/imgs/Proofs/3_2.png' alt='Graph showing the area under the curve f(x), with bounds at x and x + h marking the area of A(x + h) - A(x).'><p>As we see, <strong>A(x + h) - A(x)</strong> must be some definite area, but what? Here, we will use interesting logic in our proof. The first thing we notice is that the value of <strong>f(x)</strong> at point <strong>x</strong> shown is at a minimum, and <strong>f(x+h)</strong> is at a maximum for the interval <strong>x</strong> to <strong>x + h</strong>. That seems unique, why isn't <strong>x + h</strong> moved a bit more to the right, where it wouldn't be a maximum of the interval? Well, the key is that the expression <strong>A(x + h) - A(x)</strong> is a limit, so <strong>h</strong> is meant to be a slight nudge to <strong>x</strong>. It seems a lot more like a nudge on the graph to show the idea of the area under a curve. Since <strong>h</strong> approaches <strong>0</strong>, it is meant to be a “sufficiently small” value. This means that either <strong>f(x)</strong> or <strong>f(x + h)</strong> is a max or a min, depending if the function is increasing or not, because the distance between <strong>x</strong> and <strong>x + h</strong> will approach <strong>0</strong>. Although it doesn't really matter as we will see, the function is increasing so <strong>f(x + h)</strong> will be the max. and <strong>f(x)</strong> will be the min.</p><p>Now with that settled, why does that even matter? Well, we know the area between <strong>x</strong> and <strong>x + h</strong> is an area, and that <strong>f(x)</strong> is the lowest point on the graph, and <strong>f(x + h)</strong> is the highest. Now, we know that the area in the interval is some area value, <strong>A</strong>. Let's simplify the area for <strong>A</strong> greatly. Let's say that the area for <strong>A</strong> is just the area of some rectangle with the width of the interval <strong>h</strong>. Then, <strong>A = h * f(c)</strong>, where <strong>f(c)</strong> is some height between <strong>f(x)</strong> and <strong>f(x + h)</strong>. Ok… but how does that help us? Well, we know that <strong>f(x)</strong> is a minimum, so <strong>f(x) * h</strong> MUST be smaller than the actual area for the interval, because all other points on the graph are greater than <strong>f(x)</strong>. So, if you view the interval as the sum of a bunch of rectangles, we just took the smallest rectangle and spread it across the interval, meaning it must be smaller. With similar logic, since <strong>f(x + h)</strong> is a maximum, it MUST be larger than the actual area. With that, we know that <strong>f(c)</strong> must be somewhere between <strong>f(x)</strong> and <strong>f(x + h)</strong>. Since our function is continuous, we know that every value must exist between <strong>f(x)</strong> and <strong>f(x + h)</strong>, which means every value must exist between <strong>f(x) * h</strong> and <strong>f(x + h) * h</strong>. This means that area <strong>A</strong> must exist in the form <strong>f(c) * h</strong>, where <strong>c ∈ [x, x + h]</strong>. \\[ A'(x) = \\lim_{h \\to 0} \\left[ \\frac{A(x+h) - A(x)}{h} \\right] \\]</p><p>Back to the actual math, we've essentially just logically proven that <strong>A(x + h) - A(x) = f(c) * h</strong>. Let's substitute that in! \\[ A'(x) = \\lim_{h \\to 0} \\left[ \\frac{f(c) * h}{h} \\right] \\] \\[ A'(x) = \\lim_{h \\to 0} \\left[ f(c) \\right] \\]</p><p>Now, we know that <strong>c ∈ [x, x + h]</strong> then, \\[ x \\leq c \\leq x + h \\]</p><p>But, <strong>h→0</strong>, so: \\[ x \\leq c \\leq x \\]</p><p>Which means <strong>c = x</strong>, meaning <strong>f(c) = f(x)</strong>, solving the limit.</p><p><strong>A'(x) = f(x)</strong>, which is what we intended to prove.</p>"
            }
        ]
    },
    "proof-of-the-fundamental-theorem-of-calculus-part-ii": {
        "title": "Proof of the Fundamental Theorem of Calculus Part II",
        "sections": [
            {
                "text": "<h1>Proof of the Fundamental Theorem of Calculus Part II</h1><i>Alexander De Carlo</i><p>There is a problem with the first part of our theorem. But… didn't we just prove it true? We did, but not to where we can do anything meaningful. What do we mean by this?</p><p>Note that we just proved <strong>A'(x) = f(x)</strong>, meaning the <strong>derivative</strong> of the area function of a graph is <strong>f(x)</strong>. But what precisely is the area function? Where does it begin, and where does it conclude? How can it be effectively expressed? The graph used in proving the first part of our fundamental theorem was convenient because it had a definite starting point. However, most graphs do not. Fortunately, we can choose the starting point of a graph without a clear beginning to be anywhere. But what implications does this have for our area function?</p><p>To answer this, let's consider the <strong>derivative</strong> of <strong>x<sup>2</sup></strong>:</p>\\[ \\frac{d}{dx}\\left[ x^2 \\right] = 2x \\]<p>Cool! What about <strong>x<sup>2</sup> + 1</strong>?</p>\\[ \\frac{d}{dx}\\left[ x^2 + 1 \\right] = 2x \\]<p><strong>x<sup>2</sup> + C</strong>?</p>\\[ \\frac{d}{dx}\\left[ x^2 + C \\right] = 2x \\]<p>As we see, many things can share a <strong>derivative</strong>. Since the <strong>derivative</strong> of a constant is always <strong>0</strong>, the <strong>antiderivative</strong> of a function always has \"<strong>+ C</strong>\" after it, indicating that the <strong>antiderivative</strong> of a function is actually a family of functions that all differ from a constant value.</p><p>So, if <strong>A(x)</strong> is just the <strong>antiderivative</strong> of <strong>f(x)</strong>, which we had just proven, then <strong>A(x) = F(x) + C</strong>. <strong>F(x)</strong> is just denoting the <strong>antiderivative</strong> function for <strong>A(x)</strong>. It actually makes sense why a <strong>C</strong> needs to be there for such a general area function.</p><img src='/imgs/Proofs/4_1.png' alt='The graph shows a function f(x) and two points E and D on the x-axis with the corresponding vertical lines to the curve. The difference between the two x-coordinates is called h.'><p>Whether we start our area function at <strong>D</strong> or <strong>E</strong>, all the areas to the left of both <strong>D</strong> and <strong>E</strong> are the same. This means the area functions for both SHOULD be the same, just differing by some constant, <strong>C</strong>. This is called the <strong>indefinite integral</strong>.</p>\\[ \\int f(x) \\, dx = F(x) + C \\]<p>The explanation for the notation will be shown in a different article. Here, we are essentially finding an area function for <strong>f(x)</strong>, but we have no bounds on that function. The changing of bounds will just differ by a constant <strong>C</strong>, shown above.</p><p>We want to know how to evaluate <strong>integrals</strong> WITH bounds, however. The good thing is, we already know it should really include the area function. Let's say we start our <strong>integral</strong> at defined point <strong>a</strong>, and it goes to some variable point <strong>x</strong>.</p>\\[ A(x) = \\int_{a}^{x} f(t) \\, dt \\]<p>The variable <strong>t</strong> here is a dummy variable, because we are trying to show that <strong>x</strong> could be any point on the graph <strong>f(t)</strong>, which originally would be called <strong>f(x)</strong>. The <strong>\"x\"-axis</strong> would be called the <strong>\"t\"-axis</strong> to make things clearer. Essentially it's just changing the name of variables so as to not get the <strong>x</strong> in <strong>f(x)</strong> confused with the <strong>x</strong> on the <strong>integral</strong>.</p><p>We know that <strong>A(x)</strong> is the <strong>antiderivative</strong> of <strong>f(x)</strong>, so <strong>A(x) = F(x) + C</strong>. Thus:</p>\\[ F(x) + C = \\int_{a}^{x} f(t) \\, dt \\]<p>The important thing to note here is that we defined one boundary for the <strong>integral</strong>, at <strong>A</strong>. this means that we should be able to somehow solve for <strong>C</strong>, as <strong>C</strong> can no longer be just any constant. This <strong>integral</strong> with one bound at <strong>A</strong> should no longer be a family of <strong>antiderivatives</strong>, but just one specific <strong>antiderivative</strong>. But how can we solve it?  Well, we can do a sneaky trick. Let's make <strong>x</strong> some defined point <strong>B</strong>, essentially finding the area of some interval.</p><p>Then:</p>\\[ C = \\int_{a}^{b} f(t) \\, dt - F(b) \\]<p>That didn't really help us. But since we start at <strong>A</strong>, <strong>C</strong> must be the same, for any other arbitrary endpoint we pick. Then, how can we get rid of the nasty <strong>integral</strong>? Let's just make <strong>b = a</strong>! It's sneaky, but <strong>x</strong> can technically just be <strong>a</strong>. Now, an <strong>integral</strong> from <strong>a</strong> to <strong>a</strong> is just clearly <strong>0</strong>, because there is no area. Thus, <strong>C = -F(a)</strong>. Now, we've essentially discovered the second part of the fundamental theorem of calculus.</p>\\[ \\begin{array}{l} F(x) + C = \\int_{a}^{x} f(t) \\, dt \\\\ C = -F(a) \\end{array} \\]<p>Therefore:</p>\\[ F(x) - F(a) = \\int_{a}^{x} f(t) \\, dt \\]<p>We are pretty much done here, but the proof is shown for an interval between defined point <strong>A</strong> to defined point <strong>B</strong>, so we can just let <strong>x = a</strong>. This also allows us to not have to use the dummy variable <strong>t</strong> anymore and just make that <strong>x</strong>.</p>\\[ \\int_{a}^{b} f(x) \\, dx = F(b) - F(a) \\]<p>Simple, yet impactful. Basically, it doesn't matter at all what happens between <strong>a</strong> and <strong>b</strong>, the value for the <strong>integral</strong> on an interval is just <strong>F(b) - F(a)</strong>.</p>"
            }
        ]
    }
}